       identification division.
       program-id. Program_1.
       author. date-written.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.

       end program Program_1.